In [17]:
import numpy as np
import pandas as pd
'''
分组分类:  groupby, pivot_table, stack, unstack, unique, cut, qcut
'''

'''
groupby: "split-apply-combine" (拆分－应用－合并)
by : 可以是字典，函数，字符串或者可迭代的对象
axis : 默认是0 
level : 
as_index : 一般groupby后会变成索引，这个不会
sort : 默认是排完序后的
group_keys : 
squeeze : 
'''
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'key3' : ['x', 'x', 'y', 'x', 'y'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

      data1     data2 key1 key2 key3
0 -0.993698  0.552727    a  one    x
1  0.277411  0.311420    a  two    x
2  0.382578  0.106314    b  one    y
3 -0.781771 -1.359083    b  two    x
4  0.948832  0.046946    a  one    y

In [18]:
df.groupby('key1').size()  # 返回分组的个数

key1
a    3
b    2
dtype: int64

In [19]:
df['data1'].groupby(df['key1']).mean() # 返回各个分组的平均值

key1
a    0.077515
b   -0.199596
Name: data1, dtype: float64

In [20]:
df.groupby(['key1', 'key2']).size()  # 俩个索引

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [21]:
df.groupby(['key1', 'key2', 'key3']).size()  # 三个索引   已经分的稀巴烂了

key1  key2  key3
a     one   x       1
            y       1
      two   x       1
b     one   y       1
      two   x       1
dtype: int64

In [22]:
df.groupby(['key1', 'key2']).mean()    # 针对除索引外其他全部值做分组操作

              data1     data2
key1 key2
a    one  -0.022433  0.299836
     two   0.277411  0.311420
b    one   0.382578  0.106314
     two  -0.781771 -1.359083

In [24]:
df['data1'].groupby(df['key1']).mean()  # 针对一列做分组操作

key1
a    0.077515
b   -0.199596
Name: data1, dtype: float64

In [30]:
mean = df['data1'].groupby( [df['key1'], df['key2']] ).mean()  # 针对俩列做分组操作
mean

key1  key2
a     one    -0.022433
      two     0.277411
b     one     0.382578
      two    -0.781771
Name: data1, dtype: float64

In [33]:
key1 = np.array(['c', 'd', 'c', 'd', 'e'])
key2 = np.array(['e1', 'e2', 'e3', 'e1', 'e2'])
df['data1'].groupby([key1, key2]).mean()   # 自己传key1 和 key2 进去  自组索引   长度要和数据一样

c  e1   -0.993698
   e3    0.382578
d  e1   -0.781771
   e2    0.277411
e  e2    0.948832
Name: data1, dtype: float64

In [35]:
people = pd.DataFrame(np.random.randn(5, 5),
                     columns=['a', 'b', 'c', 'd', 'e'],
                     index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people

               a         b         c         d         e
Joe    -1.011018  1.243740 -0.666893 -0.430428  0.245595
Steve  -0.611384  1.546884  0.907944 -0.202469 -0.037511
Wes     1.788456 -0.367682 -0.506019 -0.744913  1.467904
Jim     1.174092 -0.424928 -1.064901  0.276400  1.175966
Travis  0.621574 -1.284002  1.879636  0.483061  0.488025

In [37]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f' : 'orange'}
by_column = people.groupby(mapping, axis=1)  # 这个属性牛逼了
by_column.sum()

            blue       red
Joe    -1.097321  0.478316
Steve   0.705475  0.897989
Wes    -1.250932  2.888677
Jim    -0.788501  1.925130
Travis  2.362697 -0.174403

In [38]:
people

               a         b         c         d         e
Joe    -1.011018  1.243740 -0.666893 -0.430428  0.245595
Steve  -0.611384  1.546884  0.907944 -0.202469 -0.037511
Wes     1.788456 -0.367682 -0.506019 -0.744913  1.467904
Jim     1.174092 -0.424928 -1.064901  0.276400  1.175966
Travis  0.621574 -1.284002  1.879636  0.483061  0.488025

In [39]:
people.groupby(len).sum()   # 对index进行函数转化 然后结果属性分类

          a         b         c         d         e
3  1.951529  0.451129 -2.237812 -0.898942  2.889465
5 -0.611384  1.546884  0.907944 -0.202469 -0.037511
6  0.621574 -1.284002  1.879636  0.483061  0.488025

In [42]:
key_list = ['one', 'one', 'one', 'two', 'two']
people.groupby([len, key_list]).min()    # 第一个len是对原有的index函数转化，然后结果分类，后面的key_list是相当于又加了一列索引

              a         b         c         d         e
3 one -1.011018 -0.367682 -0.666893 -0.744913  0.245595
  two  1.174092 -0.424928 -1.064901  0.276400  1.175966
5 one -0.611384  1.546884  0.907944 -0.202469 -0.037511
6 two  0.621574 -1.284002  1.879636  0.483061  0.488025

In [43]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                      [1, 3, 5, 1, 3]],
                                     names=['cty', 'tenor'])
columns

MultiIndex(levels=[['JP', 'US'], [1, 3, 5]],
           labels=[[1, 1, 1, 0, 0], [0, 1, 2, 0, 1]],
           names=['cty', 'tenor'])

In [44]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.018610 -0.274773  1.069986  1.887090 -0.132210
1      1.255104 -0.813136 -0.492215 -0.188148  0.024983
2     -0.471176  1.280435 -0.528521  0.448431  1.598832
3      0.171283  0.142774  0.103142 -0.699304  0.048022

In [50]:
hier_df.groupby(level='cty', axis=1).count()   # 一般的groupby是对列中的数据做分类   而level是以列的索引做分类  区别就是这个

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [53]:
'''
pivok table : 透视表  根据一个或多个键对数据进行聚合，并根据行和列上的分组键将数据分配到各个矩形区域中

tips.pivot_table('tip_pct', index=['time', 'size', 'smoker'], columns='day', aggfunc='mean', fill_value=0)

使用time  size  smoker 作为索引   计算 tip_pct 下的 day 的mean值  如果没有默认为0
其实很好理解 没啥很大的难度   多用几次就好了  取想要的数据  然后做对比
'''
tips = pd.read_csv('examples/tips.csv')
tips['tip_pct'] = tips['tip'] / tips['total_bill']
tips.head()

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808

In [54]:
tips.pivot_table(index=['day', 'smoker'])

                 size       tip   tip_pct  total_bill
day  smoker
Fri  No      2.250000  2.812500  0.151650   18.420000
     Yes     2.066667  2.714000  0.174783   16.813333
Sat  No      2.555556  3.102889  0.158048   19.661778
     Yes     2.476190  2.875476  0.147906   21.276667
Sun  No      2.929825  3.167895  0.160113   20.506667
     Yes     2.578947  3.516842  0.187250   24.120000
Thur No      2.488889  2.673778  0.160298   17.113111
     Yes     2.352941  3.030000  0.163863   19.190588

In [57]:
tips.pivot_table(values=['tip_pct', 'size'], index=['time', 'day'], columns='smoker')

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.139622  0.165347
       Sat   2.555556  2.476190  0.158048  0.147906
       Sun   2.929825  2.578947  0.160113  0.187250
       Thur  2.000000       NaN  0.159744       NaN
Lunch  Fri   3.000000  1.833333  0.187735  0.188937
       Thur  2.500000  2.352941  0.160311  0.163863

In [58]:
# margins 小计的意思  
tips.pivot_table('tip_pct', index=['time', 'smoker'], columns='day',aggfunc=len, margins=True)

day             Fri   Sat   Sun  Thur    All
time   smoker
Dinner No       3.0  45.0  57.0   1.0  106.0
       Yes      9.0  42.0  19.0   NaN   70.0
Lunch  No       1.0   NaN   NaN  44.0   45.0
       Yes      6.0   NaN   NaN  17.0   23.0
All            19.0  87.0  76.0  62.0  244.0

In [59]:
tips.pivot_table('tip_pct', index=['time', 'size', 'smoker'],columns='day', aggfunc='mean', fill_value=0)

day                      Fri       Sat       Sun      Thur
time   size smoker
Dinner 1    No      0.000000  0.137931  0.000000  0.000000
            Yes     0.000000  0.325733  0.000000  0.000000
       2    No      0.139622  0.162705  0.168859  0.159744
            Yes     0.171297  0.148668  0.207893  0.000000
       3    No      0.000000  0.154661  0.152663  0.000000
            Yes     0.000000  0.144995  0.152660  0.000000
       4    No      0.000000  0.150096  0.148143  0.000000
            Yes     0.117750  0.124515  0.193370  0.000000
       5    No      0.000000  0.000000  0.206928  0.000000
            Yes     0.000000  0.106572  0.065660  0.000000
       6    No      0.000000  0.000000  0.103799  0.000000
Lunch  1    No      0.000000  0.000000  0.000000  0.181728
            Yes     0.223776  0.000000  0.000000  0.000000
       2    No      0.000000  0.000000  0.000000  0.166005
            Yes     0.181969  0.000000  0.000000  0.158843
       3    No      0.187735  0.000000  0.000000  0.084246
            Yes     0.000000  0.000000  0.000000  0.204952
       4    No      0.000000  0.000000  0.000000  0.138919
            Yes     0.000000  0.000000  0.000000  0.155410
       5    No      0.000000  0.000000  0.000000  0.121389
       6    No      0.000000  0.000000  0.000000  0.173706

In [63]:
'''
stack, unstack 只是不理解为什么有时候突然就来了个stack 和 unstack(0) 之类的   目的是什么？  groupby是分组，而pivot_table是分组对比
那么这俩个的用处是什么呢?   先看几个栗子  🌰 
'''
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])
result = pd.concat([s1, s1, s3], keys=['one','two', 'three'])
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [65]:
'''
可以看出来  索引有俩列 [one two three] 和 [a b f g]
'''
result.index

MultiIndex(levels=[['one', 'two', 'three'], ['a', 'b', 'f', 'g']],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 2, 3]])

In [70]:
result.unstack()   # 看到了吧   把第二个索引给弄到上面去了   so  unstack就是将最后的索引作为列索引  重组数据

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [71]:
result.unstack(1)   # 和上面是等价的  这下子知道了这个1代表什么吧  那如何制定多个index呢 ？  猜猜就晓得了

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [72]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                 index=pd.Index(['Ohio','Colorado'], ame='state'),
                 columns=pd.Index(['one', 'two', 'three'],
                name='number'))
data

number    one  two  three
Ohio        0    1      2
Colorado    3    4      5

In [77]:
# 那我现在想要将列转化成行   目前看起来只有一列 number    
# 这种做法会自动将列移动到下一个，能否移到第一位置呢  这个问题非常好，其实是对层次化索引的重排  用swaplevel即可
data.stack(level=0)

          number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [80]:
data.stack(level=0).swaplevel(0,1)

number
one     Ohio        0
two     Ohio        1
three   Ohio        2
one     Colorado    3
two     Colorado    4
three   Colorado    5
dtype: int64

In [85]:
'''
那现在我懂了， stack是将列索引移动为行索引，level指定第几层列索引，通俗的说就是将一行数据变成列，而unstack恰恰相反  I‘m fucking genius!
stack：将数据的列“旋转”为行。
unstack：将数据的行“旋转”为列。
'''

'''
cut, qcut, 面元，分组，然后汇总，比如第一季度，第二季度，这种报表，但是该怎么用呢？    cut和qcut有什么区别，俩者的优缺点是什么?  🌰
'''
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins, right=False)  # 表示左闭右开
cats

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [86]:
'''
cut 是个特殊的Categorical对象  有codes和categories属性   codes表示下标数组   categories是分组范围
'''
cats.codes

array([0, 0, 1, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [87]:
cats.categories

IntervalIndex([[18, 25), [25, 35), [35, 60), [60, 100)]
              closed='left',
              dtype='interval[int64]')

In [88]:
pd.value_counts(cats)

[25, 35)     4
[18, 25)     4
[35, 60)     3
[60, 100)    1
dtype: int64

In [89]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']  # 小把戏  把范围改成字符串 好看些 直观 
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [MiddleAged < Senior < YoungAdult < Youth]

In [90]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.72, 0.96], (0.0053, 0.24], (0.48, 0.72], (0.24, 0.48], (0.72, 0.96], ..., (0.48, 0.72], (0.48, 0.72], (0.24, 0.48], (0.24, 0.48], (0.24, 0.48]]
Length: 20
Categories (4, interval[float64]): [(0.0053, 0.24] < (0.24, 0.48] < (0.48, 0.72] < (0.72, 0.96]]

In [91]:
pd.value_counts(pd.cut(data, 4, precision=2)) # 限定小数点2位

(0.24, 0.48]      7
(0.72, 0.96]      5
(0.48, 0.72]      5
(0.0053, 0.24]    3
dtype: int64

In [92]:
data

array([ 0.82517213,  0.06466717,  0.65711983,  0.44854085,  0.75648229,
        0.38613569,  0.29694219,  0.16238116,  0.44590851,  0.77038135,
        0.95897081,  0.00622205,  0.57707437,  0.84790308,  0.54760921,
        0.57325765,  0.62291927,  0.37178856,  0.43503935,  0.43893902])

In [93]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4) 
cats

[(0.0364, 0.784], (0.784, 3.806], (0.0364, 0.784], (-0.598, 0.0364], (-2.879, -0.598], ..., (0.784, 3.806], (-2.879, -0.598], (0.784, 3.806], (0.784, 3.806], (0.0364, 0.784]]
Length: 1000
Categories (4, interval[float64]): [(-2.879, -0.598] < (-0.598, 0.0364] < (0.0364, 0.784] < (0.784, 3.806]]

In [94]:
pd.value_counts(cats)  # qcut就是将数据等量划分的  4 代表 0.25  0.5  0.75  1.0

(0.784, 3.806]      250
(0.0364, 0.784]     250
(-0.598, 0.0364]    250
(-2.879, -0.598]    250
dtype: int64

In [95]:
# 当然也可以自己划分 分位数
cats = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])
pd.value_counts(cats)

(0.0364, 1.443]     400
(-1.199, 0.0364]    400
(1.443, 3.806]      100
(-2.879, -1.199]    100
dtype: int64

In [96]:
'''
unique:  看起来非常简单，对吧，我想知道numpy.ndarray 和  Series 或者 DataFrame  能用吗  甚至索引？  其实想下，只需要Series有就行了呀
'''
ints = np.array([3, 3, 3, 2, 2, 1, 1, 4, 4])
pd.unique(ints)

array([3, 2, 1, 4])

In [97]:
s1 = pd.Series([1, 2, 3, 4, 3, 1, 3])
s1.unique()

array([1, 2, 3, 4])